app/Controllers/MenuController.php

SELECT *
FROM `Users`
WHERE `email` = 'sunshinecafe@gmail.com'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $userModel = new \App\Models\UserModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $user = $userModel->where('email', $email)->first();

INSERT INTO `Users` (`email`, `cafe_name`, `address`) VALUES ('sunshinecafe@gmail.com', 'Endless Sunshine Cafe', '78 Queens st.')
---
    public function menuaddedit($id = null)
    {
        $userModel = new \App\Models\MenusModel();
        $data['user']['user_id'] = $this->request->getGet('user_id');

        if ($this->request->getMethod() === 'POST') {
            // Retrieve the submitted form data.
            $data = $this->request->getPost();

            // If no menu_id is provided, add new menu.
            if ($id === null) {
                if ($userModel->insert($data)) {